T = int(input())
for tc in range(1, T+1):
    N = int(input())    # 거스름돈 액수 입력

    cnt50000 = N // 50000   # 50000원권 개수
    N -= 50000 * cnt50000

    cnt10000 = N // 10000   # 10000원권 개수
    N -= 10000 * cnt10000

    cnt5000 = N // 5000     # 5천원권 개수
    N -= 5000 * cnt5000

    cnt1000 = N // 1000     # 천원권 개수
    N -= 1000 * cnt1000

    cnt500 = N // 500       # 500원 개수
    N -= 500 * cnt500

    cnt100 = N // 100       # 100원 개수
    N -= 100 * cnt100

    cnt50 = N // 50         # 50원 개수
    N -= 50 * cnt50

    cnt10 = N // 10         # 10원 개수
    N -= 10 * cnt10


    # 출력값
    print(f'#{tc}\n{cnt50000} {cnt10000} {cnt5000} {cnt1000} {cnt500} {cnt100} {cnt50} {cnt10}')
